src/Catalogs/МашиночитаемыеДоверенностиКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>МашиночитаемыеДоверенностиКонтрагентов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>XMLфайлМЧД</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Верна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗагрузкиИзРеестра</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтзыва</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Comment>Дата создания в ИБ</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Доверитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>240</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоверительИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьВРеестреФНС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НесколькоПредставителей</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоверенности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отозвана</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписана</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолномочияОграничены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПредставитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>240</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПредставительИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СовместныеПолномочия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусВРеестреФНС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыМашиночитаемойДоверенностиВРеестреФНС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОшибкиПроверкиМЧД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлОбмена</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектроннаяПодпись</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИННДоверителяРодительскойДоверенности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерРодительскойДоверенности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСкриптПроверкиПолномочий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантЗаполненияПолномочий</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыЗаполненияПолномочийМЧД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Представители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Представитель</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>240</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставительИНН</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>12</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/СертификатыЭЦП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>СертификатыЭЦП</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьПоСертификату</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапомнитьПарольКСертификату</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграничитьДоступКСертификату</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОповещенОСрокеДействия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отозван</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отпечаток</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПользователь</Name>
					<Comment>Пользователь, кому доступен сертификат подписи</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверятьСоставИсполнителей</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрограммаБанка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПрограммыБанка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлСертификата</Name>
					<Comment>Двоичные данные сертификата</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВидыДокументов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДокумента</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыЭД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИспользоватьДляПодписи</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоставИсполнителей</Name>
					<Comment>Список пользователей, после утверждения или подписания которых, документ переходит на подпись по данному сертификату</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Исполнитель</Name>
							<Comment>Пользователь или группа пользователей</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокПользователей</Name>
					<Comment>Список пользователей, которым доступен сертификат. (если список пустой сертификат доступен всем пользователям)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Comment>Пользователь или группа пользователей</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/МашиночитаемыеДоверенностиВызовСервера/Ext/Module.bsl
// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

#Область ПроверкаПодписи

// См. МашиночитаемыеДоверенности.ЗаписатьРезультатПроверкиПолномочий
Функция ЗаписатьРезультатПроверкиПолномочий(Знач ДанныеПроверки) Экспорт;
	Возврат МашиночитаемыеДоверенности.ЗаписатьРезультатПроверкиПолномочий(ДанныеПроверки);
КонецФункции

#КонецОбласти

// Выгрузить данные доверенности в строку XML.
// 
// Параметры:
//  СправочникСсылка - СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций
//  				 - СправочникСсылка.МЧД003
// 
// Возвращаемое значение:
//  См. МашиночитаемыеДоверенности.ВыгрузитьXML
Функция ВыгрузитьXML(Знач СправочникСсылка) Экспорт
	
	Возврат МашиночитаемыеДоверенности.ВыгрузитьXML(СправочникСсылка);
	
КонецФункции

// См. МашиночитаемыеДоверенности.ЗагрузитьМЧДИзФайла
Функция ЗагрузитьМЧД(Знач ДанныеДляЗагрузки, ТребуетсяПроверкаМЧДНаКлиенте, Знач ОбновлятьСуществующий = Ложь,
	Знач ДополнительныеСведения = Неопределено) Экспорт

	Возврат МашиночитаемыеДоверенности.ЗагрузитьМЧДИзФайла(ДанныеДляЗагрузки, ТребуетсяПроверкаМЧДНаКлиенте,
		ОбновлятьСуществующий, ДополнительныеСведения);

КонецФункции

// См. МашиночитаемыеДоверенности.ЗагрузитьРодительскиеДоверенности
Процедура ЗагрузитьРодительскиеДоверенности(МЧД) Экспорт

	МашиночитаемыеДоверенности.ЗагрузитьРодительскиеДоверенности(МЧД);

КонецПроцедуры

// См. МашиночитаемыеДоверенности.ВыгрузитьЗаявлениеНаОтменуМЧД
Функция ВыгрузитьЗаявлениеНаОтменуМЧД(Знач НомерДоверенности, Знач ПричинаОтмены) Экспорт
	
	Возврат МашиночитаемыеДоверенности.ВыгрузитьЗаявлениеНаОтменуМЧД(НомерДоверенности, ПричинаОтмены);
	
КонецФункции

// См. МашиночитаемыеДоверенности.ПолучитьНомерМЧД
Функция ПолучитьНомерМЧД(Знач ТокенДоступа = "") Экспорт
	
	Возврат МашиночитаемыеДоверенности.ПолучитьНомерМЧД(ТокенДоступа);
	
КонецФункции

// Регистрирует МЧД на сервере МЧД.
// 
// Параметры:
//  СсылкаНаДоверенность - СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций
//  					 - СправочникСсылка.МЧД003
//  ДанныеВыгрузки - ДвоичныеДанные - Данные выгрузки
//  ДанныеПодписи - ДвоичныеДанные - Данные подписи
//  ТокенДоступа - Строка - Токен доступа
//  НомерДоверенности - Строка - Номер доверенности
// 
// Возвращаемое значение:
//  См. МашиночитаемыеДоверенности.ЗарегистрироватьМЧД
Функция ЗарегистрироватьМЧД(Знач СсылкаНаДоверенность, ДанныеВыгрузки, Знач ДанныеПодписи, Знач ТокенДоступа = "",
	Знач НомерДоверенности = "") Экспорт
	
	Возврат МашиночитаемыеДоверенности.ЗарегистрироватьМЧД(ДанныеВыгрузки, ДанныеПодписи,
		ТокенДоступа, НомерДоверенности, СсылкаНаДоверенность);
	
КонецФункции

// См. МашиночитаемыеДоверенности.ПолучитьСтатусТранзакцииМЧД
Функция ПолучитьСтатусТранзакцииМЧД(Знач ИдентификаторТранзакции,
	Знач ТокенДоступа = "", Знач НомерДоверенности = "") Экспорт
	
	Возврат МашиночитаемыеДоверенности.ПолучитьСтатусТранзакцииМЧД(ИдентификаторТранзакции, ТокенДоступа,
		НомерДоверенности);
	
КонецФункции

// См. МашиночитаемыеДоверенности.ПолучитьСведенияДоверенностиНаСервереМЧД
Функция ПолучитьСведенияДоверенностиНаСервереМЧД(Знач НомерДоверенности,
	Знач ИННДоверителя, Знач ТокенДоступа = "") Экспорт
	
	Возврат МашиночитаемыеДоверенности.ПолучитьСведенияДоверенностиНаСервереМЧД(
		НомерДоверенности, ИННДоверителя, ТокенДоступа);
	
КонецФункции

// См. МашиночитаемыеДоверенности.ПолучитьЧастичныеДанныеДоверенностиНаСервереМЧД
Функция ПолучитьЧастичныеДанныеДоверенностиНаСервереМЧД(Знач НомерДоверенности, Знач ТокенДоступа = "") Экспорт
	
	Возврат МашиночитаемыеДоверенности.ПолучитьЧастичныеДанныеДоверенностиНаСервереМЧД(НомерДоверенности, ТокенДоступа);
	
КонецФункции

// См. МашиночитаемыеДоверенности.ОтменитьМЧД
Функция ОтменитьМЧД(Знач ИмяФайлаВыгрузки, Знач ДанныеВыгрузки, Знач ДанныеПодписи, Знач ДанныеСертификата, 
	Знач ТокенДоступа = "", Знач НомерДоверенности = "", Знач СсылкаНаДоверенность = Неопределено) Экспорт
	
	Возврат МашиночитаемыеДоверенности.ОтменитьМЧД(ИмяФайлаВыгрузки, ДанныеВыгрузки, ДанныеПодписи, ДанныеСертификата,
		ТокенДоступа, НомерДоверенности, СсылкаНаДоверенность);
	
КонецФункции

// См. МашиночитаемыеДоверенности.ПолучитьНомераДоверенностей
Функция ПолучитьНомераДоверенностей(Знач Доверенности) Экспорт
	
	Возврат МашиночитаемыеДоверенности.ПолучитьНомераДоверенностей(Доверенности);
	
КонецФункции

// См. Справочники.МашиночитаемыеДоверенностиКонтрагентов.ЗагрузитьМЧДИзФайла
Функция ЗагрузитьМЧДКонтрагентаИзФайла(Знач ДанныеФайла) Экспорт
	
	Возврат Справочники.МашиночитаемыеДоверенностиКонтрагентов.ЗагрузитьМЧДИзФайла(ДанныеФайла);
	
КонецФункции

// См. Справочники.МашиночитаемыеДоверенностиОрганизаций.ЗагрузитьМЧДИзФайла
Функция ЗагрузитьМЧДОрганизацииИзФайла(Знач ДанныеФайла) Экспорт
	
	Возврат Справочники.МашиночитаемыеДоверенностиОрганизаций.ЗагрузитьМЧДИзФайла(ДанныеФайла);
	
КонецФункции

// См. МашиночитаемыеДоверенности.ЗагрузитьМЧДИзФайла
Функция ЗагрузитьМЧДИзФайла(Знач АдресХранилища) Экспорт
	Возврат МашиночитаемыеДоверенности.ЗагрузитьМЧДИзФайла(АдресХранилища);
КонецФункции

// См. МашиночитаемыеДоверенности.ОтразитьРезультатПроверкиМЧД
Процедура ОтразитьРезультатПроверкиМЧД(Знач МЧД, Знач Верна, Знач ТекстОшибки) Экспорт
	
	МашиночитаемыеДоверенности.ОтразитьРезультатПроверкиМЧД(МЧД, Верна, ТекстОшибки);
	
КонецПроцедуры

// См. МашиночитаемыеДоверенности.ДанныеФайлаДоверенностиИПодписи
Функция ДанныеФайлаДоверенностиИПодписи(Знач МЧД) Экспорт
	
	Возврат МашиночитаемыеДоверенности.ДанныеФайлаДоверенностиИПодписи(МЧД);
	
КонецФункции

// См. МашиночитаемыеДоверенности.ВыполнитьДействияПослеПодписания
Процедура ВыполнитьДействияПослеПодписания(Знач Доверенность, Знач ДанныеВыгрузки,
	Знач СвойстваПодписи, ТребуетсяПроверкаМЧДНаКлиенте = Ложь) Экспорт
	
	МашиночитаемыеДоверенности.ВыполнитьДействияПослеПодписания(Доверенность, ДанныеВыгрузки,
		СвойстваПодписи, ТребуетсяПроверкаМЧДНаКлиенте);
	
КонецПроцедуры

// Получает доверенность из журнала
//
// Параметры:
//  НомерДоверенности - Строка - Номер доверенности
//
// Возвращаемое значение:
//  ОпределяемыйТип.МашиночитаемаяДоверенность - Доверенность
Функция ПолучитьДоверенностьИзЖурналаПоНомеру(НомерДоверенности) Экспорт
	Возврат МашиночитаемыеДоверенности.ПолучитьДоверенностьИзЖурналаПоНомеру(НомерДоверенности);
КонецФункции

// Получает совокупный список из 10 первых элементов данных выбора по нескольким типам справочников.
// Например, общиц список по справочникам Организации и Контрагенты.
// Приоритет ссылок определяется порядком указания типа в параметре ТипыСубъектов
// 
// Параметры:
//  СтрокаПоиска - Строка - Строка поиска
//  ТипыСубъектов - СписокЗначений Из Тип - Типы ссылок, для запроса данных выбора
// 
// Возвращаемое значение:
//  СписокЗначений Из ЛюбаяСсылка - представление элемента имеет вид "<Представление ссылки> [<Синоним справочника>]"
Функция ДанныеВыбораСубъекта(Знач СтрокаПоиска, Знач ТипыСубъектов) Экспорт
	Возврат МашиночитаемыеДоверенности.ДанныеВыбораСубъекта(СтрокаПоиска, ТипыСубъектов);
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// См. МашиночитаемыеДоверенности.РезультатПроверкиДоверенности
Функция РезультатПроверкиДоверенности(ДанныеДоверенности, РезультатПроверкиПодписи, КонтекстДиагностики) Экспорт
	
	Возврат МашиночитаемыеДоверенности.РезультатПроверкиДоверенности(ДанныеДоверенности, РезультатПроверкиПодписи,
		КонтекстДиагностики);
	
КонецФункции

// См. МашиночитаемыеДоверенности.ДатаОтзываДоверенности
Функция ДатаОтзываДоверенности(НомерДоверенности, ДоверительИНН, ТокенДоступа = "") Экспорт
	
	Возврат МашиночитаемыеДоверенности.ДатаОтзываДоверенности(НомерДоверенности, ДоверительИНН, ТокенДоступа);
	
КонецФункции

// См. МашиночитаемыеДоверенности.ЦветаФона 
Функция ЦветаФона() Экспорт
	
	Возврат МашиночитаемыеДоверенности.ЦветаФона();
	
КонецФункции

// См. МашиночитаемыеДоверенности.ТипПоддержанОператором 
Функция ТипПоддержанОператором(Оператор, ТипДоверенности) Экспорт
	
	Возврат МашиночитаемыеДоверенности.ТипПоддержанОператором(Оператор, ТипДоверенности);
	
КонецФункции

#КонецОбласти


////////////////////////////////////////////////////////////////////////////////
// Адаптация

Функция ПолучитьДвоичныеДанныеМЧД(Ссылка) Экспорт
	Возврат МашиночитаемыеДоверенности.ПолучитьДвоичныеДанныеМЧД(Ссылка);
КонецФункции

Функция СписокВыбораДоверенностей(Организация, СертификатЭЦП) Экспорт
	
	Отбор = МашиночитаемыеДоверенности.НовыйОтборМЧД();
	Отбор.Доверитель = Организация;
	Отбор.Сертификат = СертификатЭЦП;
	Доверенности = МашиночитаемыеДоверенности.ПолучитьДоверенностиОрганизации(Отбор);
	Справочники.МЧД003.ДополнитьСписокДоверенностейПоОтбору(Отбор, Доверенности);

	Возврат Доверенности;
	
КонецФункции

Функция РеквизитыМЧД(МЧД) Экспорт
	
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(МЧД, "Организация, Верна, Отозвана, НомерДоверенности");
	
	Возврат Реквизиты;	
	
КонецФункции

Функция ПолучитьСертификатыДляПодписанияМЧД(МЧД, МассивСтруктурСертификатов = Неопределено) Экспорт 
	
	Результат = Новый Массив;
	
	ЗапросПоСертификатам = Новый Запрос;
	ЗапросПоСертификатам.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	СертификатыЭЦП.Ссылка,
	|	ВЫБОР
	|		КОГДА СертификатыЭЦП.ЗапомнитьПарольКСертификату
	|			ТОГДА СертификатыЭЦП.ПарольПользователя
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ПарольПользователя,
	|	СертификатыЭЦП.ЗапомнитьПарольКСертификату,
	|	СертификатыЭЦП.ЗапомнитьПарольКСертификату КАК ПарольПолучен,
	|	"""" КАК Комментарий,
	|	СертификатыЭЦП.Отпечаток
	|ИЗ
	|	Справочник.СертификатыЭЦП КАК СертификатыЭЦП
	|ГДЕ
	|	НЕ СертификатыЭЦП.Отозван
	|	И (СертификатыЭЦП.СписокПользователей.Пользователь = &ТекущийПользователь
	|		ИЛИ НЕ СертификатыЭЦП.ОграничитьДоступКСертификату)
	|	И НЕ СертификатыЭЦП.ПометкаУдаления
	|	И СертификатыЭЦП.Организация.%2 В (&ИННОрганизаций)
	|	И ВЫБОР
	|			КОГДА СертификатыЭЦП.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ИСТИНА
	|			КОГДА РАЗНОСТЬДАТ(&ТекущаяДата, СертификатыЭЦП.ДатаОкончания, МИНУТА) > 0
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|	И %1";

	
	ИННОрганизаций = Новый Массив;
	
	Доверители = Новый ТаблицаЗначений;
	Доверители.Колонки.Добавить("ИНН");
	Доверители.Колонки.Добавить("ОГРН");
	Доверители.Колонки.Добавить("СНИЛС");
	
	Если МашиночитаемыеДоверенности.ЭтоМЧД003(МЧД) Тогда
		РеквизитыМЧД = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(МЧД, "Доверители, ФайлМЧД");
		
		РеквизитыМЧДДоверители = РеквизитыМЧД.Доверители.Выбрать();
		Пока РеквизитыМЧДДоверители.Следующий() Цикл
		    Доверитель = Доверители.Добавить();
			Доверитель.ИНН   = РеквизитыМЧДДоверители.ИНН;
			Доверитель.ОГРН  = РеквизитыМЧДДоверители.ОГРН;
			Доверитель.СНИЛС = РеквизитыМЧДДоверители.СНИЛС;
			
			Если Не ЗначениеЗаполнено(Доверитель.Снилс) Тогда
				РезультатЧтения = МашиночитаемыеДоверенности.ОбъектXDTOМЧД(РеквизитыМЧД.ФайлМЧД.Получить());
				СНИЛСДоверителяФЛ = Справочники.МЧД003.СНИЛСЛицДействующихБезДоверенности(РезультатЧтения.ОбъектМЧД);
				Доверитель.СНИЛС = СНИЛСДоверителяФЛ;
			КонецЕсли;			
			
			ИННОрганизаций.Добавить(Доверитель.ИНН);
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(МЧД) = Тип("СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций") Тогда
		ДанныеОрганизации = Новый Структура;
		ЭлектронныеДокументыПереопределяемый.ЗаполнитьРегистрационныеДанныеОрганизации(МЧД.Организация, ДанныеОрганизации);
		
		РеквизитыМЧД = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(МЧД, "Организация, ЛицоБезДовФЛ_СНИЛС");
		
	    Доверитель = Доверители.Добавить();
		Доверитель.ИНН   = ДанныеОрганизации.ИНН;
		Доверитель.ОГРН  = ДанныеОрганизации.ОГРН;
		Доверитель.СНИЛС = РеквизитыМЧД.ЛицоБезДовФЛ_СНИЛС;
		
		ИННОрганизаций.Добавить(Доверитель.ИНН);
	Иначе
		Возврат Результат;
	КонецЕсли;
	
	ДопУсловие = "ИСТИНА";
	Если ЗначениеЗаполнено(МассивСтруктурСертификатов) Тогда
		МассивОтпечатков = Новый Массив;
		Для Каждого ЭлементСтруктуры Из МассивСтруктурСертификатов Цикл
			МассивОтпечатков.Добавить(ЭлементСтруктуры.Отпечаток);
		КонецЦикла;		
		ЗапросПоСертификатам.УстановитьПараметр("МассивОтпечатков", МассивОтпечатков);
		ДопУсловие = " СертификатыЭЦП.Отпечаток В(&МассивОтпечатков)";		
	КонецЕсли;
	
	ИмяРеквизитаИННОрганизации = ЭлектронныеДокументыПовтИсп.ИмяНаличиеОбъектаРеквизитаВПрикладномРешении("ИННОрганизации");
	
	ЗапросПоСертификатам.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
																	ЗапросПоСертификатам.Текст,
																	ДопУсловие, ИмяРеквизитаИННОрганизации);	
																	
	ЗапросПоСертификатам.УстановитьПараметр("ТекущийПользователь", Пользователи.АвторизованныйПользователь());	
	ЗапросПоСертификатам.УстановитьПараметр("ИННОрганизаций", ИННОрганизаций);
	ЗапросПоСертификатам.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	
	РезультатЗапроса = ЗапросПоСертификатам.Выполнить().Выгрузить();
	ДвоичныеДанныеСертификатов = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(РезультатЗапроса.ВыгрузитьКолонку("Ссылка"), "ФайлСертификата"); 
	ВыборкаСертификатов = ЭлектронныеДокументыСлужебный.ТаблицаЗначенийВМассив(РезультатЗапроса);
	
	Для Каждого СертификатВыборки из ВыборкаСертификатов Цикл
		
		Для Каждого Доверитель Из Доверители Цикл
			Если МашиночитаемыеДоверенности.ЭтоСертификатДоверителя(
				Доверитель.ИНН,
				Доверитель.ОГРН,
				Доверитель.СНИЛС,
				ДвоичныеДанныеСертификатов[СертификатВыборки.Ссылка].Получить()) Тогда
				
				Результат.Добавить(СертификатВыборки);			
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
		
	Возврат Результат;
	
КонецФункции                   

Функция ФорматированнаяСтрока(Знач ШаблонСтроки, Знач Параметр1 = Неопределено, Знач Параметр2 = Неопределено,
	Знач Параметр3 = Неопределено, Знач Параметр4 = Неопределено, Знач Параметр5 = Неопределено) Экспорт

	Возврат МашиночитаемыеДоверенности.ФорматированнаяСтрока(ШаблонСтроки, Параметр1, Параметр2, Параметр3, Параметр4, Параметр5);
	
КонецФункции

Процедура ДобавитьДоверенностиСообщений(ПодписанныйОбъект, Доверенности) Экспорт
	МашиночитаемыеДоверенности.ДобавитьДоверенностиСообщений(ПодписанныйОбъект, Доверенности);
КонецПроцедуры

// Возвращает хеш-сумму подписи.
// 
// Параметры:
//  Подпись - ДвоичныеДанные
// 
// Возвращаемое значение:
//  Строка - хеш-сумма
Функция ХешПодписи(Подпись) Экспорт
	Возврат МашиночитаемыеДоверенности.ХешПодписи(Подпись);	
КонецФункции

Функция ИмеетсяПравоИзмененияМЧД() Экспорт
	Возврат МашиночитаемыеДоверенности.ИмеетсяПравоИзмененияМЧД();	
КонецФункции
